//Типы плат часов
#if (BOARD_TYPE == 0)
//------------------Ручной режим настройки конфигурации------------------//
const uint8_t digitMask[] = {DIGIT_MASK}; //порядок пинов лампы(другие платы)
const uint8_t cathodeMask[] = {CATHODE_MASK}; //порядок катодов(другие платы)
#elif (BOARD_TYPE == 1)
//------------------[AlexGyver v2] ИН12 (Индикаторы стоят правильно)------------------//
const uint8_t digitMask[] = {ID(7), ID(3), ID(6), ID(4), ID(1), ID(9), ID(8), ID(0), ID(5), ID(2), ID(10)}; //маска дешифратора платы ИН12 (цифры нормальные)(цифра "10" - это пустой символ, должен быть всегда в конце)
const uint8_t cathodeMask[] = {1, 6, 2, 7, 5, 0, 4, 9, 8, 3}; //порядок катодов ИН12
#elif (BOARD_TYPE == 2) || (BOARD_TYPE == 3)
#undef ANODE_1_PIN
#define ANODE_1_PIN 6 //пин анода 1(ЧЧ)(0..13)(pin D)
#undef ANODE_2_PIN
#define ANODE_2_PIN 5 //пин анода 2(ЧЧ)(0..13)(pin D)
#undef ANODE_3_PIN
#define ANODE_3_PIN 4 //пин анода 3(ММ)(0..13)(pin D)
#undef ANODE_4_PIN
#define ANODE_4_PIN 3 //пин анода 4(ММ)(0..13)(pin D)
#if (BOARD_TYPE == 2)
//------------------[AlexGyver v2] ИН12 turned (Индикаторы перевёрнуты)------------------//
const uint8_t digitMask[] = {ID(2), ID(8), ID(1), ID(9), ID(6), ID(4), ID(3), ID(5), ID(0), ID(7), ID(10)}; //маска дешифратора платы ИН12 turned (цифры вверх ногами)(цифра "10" - это пустой символ, должен быть всегда в конце)
const uint8_t cathodeMask[] = {1, 6, 2, 7, 5, 0, 4, 9, 8, 3}; //порядок катодов ИН12
#elif (BOARD_TYPE == 3)
//------------------[AlexGyver v2] ИН14 (Обычная и neon dot)------------------//
const uint8_t digitMask[] = {ID(9), ID(8), ID(0), ID(5), ID(4), ID(7), ID(3), ID(6), ID(2), ID(1), ID(10)}; //маска дешифратора платы ИН14(цифра "10" - это пустой символ, должен быть всегда в конце)
const uint8_t cathodeMask[] = {1, 0, 2, 9, 3, 8, 4, 7, 5, 6}; //порядок катодов ИН14
#endif
#else
//------------------Для кастомных пресетов прошивки------------------//
#endif
