//---------------------------Отправка данных на шину-------------------------------------------
inline void writeSPI(uint8_t data)
{
  __asm__ __volatile__ (
    "LDI __tmp_reg__, 8               \n\t" //счетчик циклов байта
    "_LOOP_START_%=:                  \n\t" //начало цикла отправки бита
    //-----------------------------------------------------------------------------------------
    "SBRS %[DATA], 7                  \n\t" //если бит "7" установлен то пропускаем переход
    "CBI %[_MOSI_PORT], %[_MOSI_PIN]  \n\t" //LOW на выход пина бит
    "SBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //LOW на выход пина такта
    "LSL %[DATA]                      \n\t" //сдвигаем байт влево
    "CBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //HIGH на выход пина такта
    "SBI %[_MOSI_PORT], %[_MOSI_PIN]  \n\t" //HIGH на выход пина бит
    //-----------------------------------------------------------------------------------------
    "DEC __tmp_reg__                  \n\t" //декремент счетчика циклов байта
    "BRNE _LOOP_START_%=              \n\t" //переход в начало цикла отправки бита
    : "=r"(data)
    : [DATA]"0"(data),
    [_MOSI_PORT]"I"(_SFR_IO_ADDR(SD_MOSI_PORT)),
    [_MOSI_PIN]"I"(SD_MOSI_BIT),
    [_SCK_PORT]"I"(_SFR_IO_ADDR(SD_SCK_PORT)),
    [_SCK_PIN]"I"(SD_SCK_BIT)
  );
}
//-----------------------------Чтение данных с шины-------------------------------------------
inline uint8_t readSPI(void)
{
  uint8_t data = 0;
  __asm__ __volatile__ (
    //-----------------------------------------------------------------------------------------
    "LDI __tmp_reg__, 8               \n\t" //счетчик циклов байта
    "_LOOP_START_%=:                  \n\t" //начало цикла отправки бита
    //-----------------------------------------------------------------------------------------
    "SBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //HIGH на выход пина такта
    "LSL %[DATA]                      \n\t" //сдвигаем байт влево
    "SBIC %[_MISO_PORT], %[_MISO_PIN] \n\t" //если бит MISO очищен то пропускаем команду
    "ORI %[DATA], 0x01                \n\t" //установили бит
    "CBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //LOW на выход пина такта
    //-----------------------------------------------------------------------------------------
    "DEC __tmp_reg__                  \n\t" //декремент счетчика циклов байта
    "BRNE _LOOP_START_%=              \n\t" //переход в начало цикла отправки бита
    : [DATA]"=r"(data)
    : [_MISO_PORT]"I"(_SFR_IO_ADDR(PIN_REG(SD_MISO_PORT))),
    [_MISO_PIN]"I"(SD_MISO_BIT),
    [_SCK_PORT]"I"(_SFR_IO_ADDR(SD_SCK_PORT)),
    [_SCK_PIN]"I"(SD_SCK_BIT)
  );
  return data;
}
